Repository: haoict/tiktok-god
Catalog: pref/Resources/*.lproj/Root.strings
Languages: ar, de, ru, th, tr

source: Apply
ar: تطبيق
de: Anwenden
ru: Применить
th: นำไปใช้งาน
tr: Uygula

source: Do you really want to kill TikTok?
ar: هل تريد حقًا إغلاق TikTok؟
de: Willst du TikTok wirklich neu laden?
ru: Уверены, что хотите закрыть TikTok?
th: คุณต้องการที่จะปิดแอป TikTok หรือไม่
tr: Gerçekten ayarları uygulamak istiyor musun?

source: Confirm
ar: تأكيد
de: Bestätigen
ru: Подтвердить
th: ยืนยัน
tr: Onayla

source: Cancel
ar: إلغاء
de: Abbrechen
ru: Отмена
th: ยกเลิก
tr: Vazgeç

source: Default
ar: تقصير
de: Standard
ru: По умолчанию
th: ค่าเริ่มต้น

source: Main Preferences
ar: التفضيلات الرئيسية
de: Haupteinstellungen
ru: Основные настройки
th: ตั้งค่าทั่วไป
tr: Ana Tercihler

source: No Ads
ar: لا اعلانات
de: Keine Werbung
ru: Удалить рекламу
th: ลบโฆษณา
tr: Reklamsız

# REMOVE_SPONSORED_VIDEO
source: Remove "Sponsored" videos
ar: إزالة مقاطع الفيديو "الدعائية"
de: "Gesponserte" Videos entfernen
ru: Удаление "Спонсорских" роликов
th: ลบวิดีโอ "สนับสนุน" ออก

source: Unlimited Download
ar: تحميل غير محدود
de: Unbegrenzter Download
ru: Безлимитные загрузки
th: ดาวน์โหลดไม่จำกัด
tr: Sınırsız indir

# CAN_DOWNLOAD_UNDOWNLOADABLE_VIDEO
source: Can download undownloadable videos
ar: يمكن تنزيل مقاطع الفيديو غير القابلة للتنزيل
de: Kann nicht herunterladbare Videos herunterladen
ru: Позволяет загружать незагружаемые ролики
th: สามารถดาวน์โหลดวิดีโอที่ป้องกันการดาวน์โหลดได้
tr: Alınan videoları indirebilir

source: Download Without Watermark
ar: تحميل بدون علامة مائية
de: Ohne Wasserzeichen laden
ru: Скачивать без водяных знаков
th: ดาวน์โหลดวิดีโอโดยไม่มีลายน้ำ
tr: Filigran olmadan indir

# PRESS_AND_HOLD_VIDEO_TO_SHOW_DOWNLOAD_BUTTON
source: Press and hold video to show download butto
ar: اضغط مع الاستمرار على الفيديو لإظهار خيار التنزيل
de: Halte das Video gedrückt, um die Download-Schaltfläche anzuzeigen
ru: Зажмите пальцем на видео, чтобы отобразить кнопку загрузки
th: แตะวิดีโอค้างไว้เพื่อแสดงปุ่มดาวน์โหลด
tr: İndirme düğmesini göstermek için video tuşunu basılı tutun.

source: Auto Play Next Video
ar: التشغيل التلقائي للفيديو التالي
de: Nächstes Video automatisch
ru: Авто-перелистывание роликов
th: เล่นวิดีโอถัดไปโดยอัตโนมัติ
tr: Sonraki video otomatik oynat

# FINGER_FREE
source: Finger free, yeah!
ar: بدون اصبع ، نعم!
de: Finger frei, ja!
ru: Никаких пальцев!
th: ไม่ต้องใช้นิ้วอีกต่อไป แจ๋วไปเลย

source: Change Region
ar: تغيير المنطقة
de: Region ändern
ru: Смена региона
th: เปลี่ยนภูมิภาค
tr: Bölge değiştir

source: View TikTok from another country
ar: شاهد TikTok من بلد آخر
de: TikTok aus einem anderen Land anzeigen
ru: Просматривайте ТикТоки с других стран
th: ดู TikTok จากประเทศอื่นได้
tr: Tiktok'u başka bir ülkeden görüntüle

source: (may not work for iPad and some devices)
ar: (قد لا يعمل مع iPad وبعض الأجهزة)
de: (funktioniert möglicherweise nicht für iPad)
ru: (возможно, не будет работать на iPad и некоторых устройствах)
th: (อาจไม่ทำงานกับ iPad และอุปกรณ์บางอย่าง)
tr: (iPad ve bazı cihazlar için çalışmayabilir)

source: Select Country
ar: حدد الدولة
de: Land auswählen
ru: Выберите страну
th: เลือกภูมิภาค
tr: Ülke'yi seçin

source: Show progress bar
ar: إظهار شريط التقدم
de: Fortschrittsbalken anzeigen
ru: Отображать прогресс-бар
th: แสดงแถบเวลาวิดีโอ
tr: İlerleme çubuğunu göster

source: For fast forward or rewind video
ar: للتقديم السريع أو الإرجاع للفيديو
de: Zum schnellen Vor- oder Zurückspulen
ru: Для быстрой перемотки видео
th: เพื่อให้สามารถกรอวิดีโอไปข้างหน้าหรือถอยกลับได้
tr: Hızlı ileri veya geri sarma videosu için

source: Can hide UI
ar: يمكن إخفاء واجهة المستخدم
de: Benutzeroberfläche ausblenden
ru: Скрывать кнопки
th: ซ่อน UI ได้
tr: Sakla UI

source: Enable Show/Hide UI button
ar: تمكين زر إظهار / إخفاء واجهة المستخدم
de: UI-Schaltfläche ein/aus aktivieren
ru: Скрывать/отображать кнопки на ролике
th: เปิดใช้งาน ซ่อน/แสดงปุ่ม UI (แผงเมนูต่าง ๆ ในหน้าเล่นวิดีโอ)
tr: Gösteriyi Göster/Gizle UI düğmesini

# ENABLE_FAV_COLLECTIONS
source: Enable Favorites Collections
ar: تمكين مجموعات المفضلة
de: Favoritensammlungen aktivieren
ru: Коллекция Избранных
th: เปิดใช้งานคอลเลกชั่นรายการโปรด
tr: Favori Koleksiyonlarını Etkinleştir

source: More Features Comming Soon
ar: المزيد من الميزات قريبا
de: Weitere Funktionen in Kürze
ru: Еще больше функций в будущем
th: ฟีเจอร์เพิ่มเติมกำลังจะมาเร็ว ๆ นี้
tr: Yakında daha fazla özellik

source: Other Preferences
ar: تفضيلات أخرى
de: Andere Einstellungen
ru: Остальные настройки
th: ตั้งค่าอื่น ๆ
tr: Diğer tercihler

source: Show Top Right Corner Download Button
ar: إظهار زر تنزيل الزاوية اليمنى العلوية
de: Download-Schaltfläche in der oberen rechten Ecke anzeigen
ru: Отображать кнопку загрузки в верхнем правом углу
th: แสดงปุ่มดาวน์โหลดมุมขวาด้านบนของแอป
tr: Üst sağ köşe indirme düğmesini göster

source: Reset Settings
ar: اعادة الضبط
de: Einstellungen zurücksetzen
ru: Сбросить настройки
th: รีเซ็ตการตั้งค่าใหม่
tr: Ayarları Sıfırla

source: Support Me
ar: ادعمني
de: Unterstütze mich
ru: Поддержка
th: สนับสนุนพวกเรา
tr: Beni destekle

source: Donation 💰
ar: التبرع 💰
de: Spende 💰
ru: Донат 💰
th: บริจาค 💰
tr: Bağış Money bag

source: Buy me a coffee
ar: اشتري لي قهوة
de: Kauf mir einen Kaffee
ru: Угостите чашечкой кофе
th: ช่วยสนับสนุนค่ากาแฟของพวกเรา
tr: Bana bir kahve al

source: Feature Request ✨
ar: لطلب الميزة ✨
de: Erweiterung anfragen ✨
ru: Предложение функций ✨
th: ส่งคำขอฟีเจอร์อื่น ๆ ✨
tr: Özellik isteği Sparkles

source: Send Me An Email With Your Request
ar: أرسل لي بريدًا إلكترونيًا مع طلبك
de: Sende mir eine E-Mail mit deiner Anfrage
ru: Отправьте мне сообщение с предложением по почте
th: ส่งคำขอฟีเจอร์ที่คุณต้องการถึงฉันผ่านอีเมล
tr: Bana bir e-posta gönder

source: Source Code 🤖
ar: كود المصدر 🤖
de: Quellcode 🤖
ru: Исходный код 🤖
th: ซอร์สโค้ด 🤖
tr: Kaynak kodu Robot face

source: Found A Bug 🐛
ar: وجدت مشكلة🐛
de: Fehler gefunden 🐛
ru: Сообщить об ошибке 🐛
th: พบปัญหาการใช้งาน 🐛
tr: Bir hata buldum Bug

source: Leave A Bug Report on Github
ar: اترك تقرير خطأ على جيثب
de: Hinterlasse einen Fehlerbericht auf Github
ru: Опишите найденный баг в Github-е
th: รายงานปัญหาไปที่ Github
tr: GitHub hakkında bir hata raporu bırakın
